&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Склад 	    = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
	
	НачатьПомещениеФайла(Оповещение,,,Истина,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли; 
	ФайлЗаявки =  Новый файл(ВыбранноеИмяФайла);
	Если НЕ ФайлЗаявки.Существует() Тогда
		 Возврат;
	КонецЕсли; 
	ФайлExcell = ВыбранноеИмяФайла;	
	ЗагрузкаНАСервере();
	Элементы.ДеревоКоличество.ТекстПодвала = "Итого: "+ДеревоЗаказа.Итог("Количество");
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаНаСервере()
	ВКФайл = СохранитьВК();
	
	СтрокаИННКПП = 3;
	КолонкаИННКПП = 1;
	СтрокаКПП	 = 3;
	
	//ВК
	Попытка	
		ПодключитьВнешнююКомпоненту(ВКФайл,"ExcelNative",AddInType.Native);
		XLS =Новый("AddIn.ExcelNative.V8Excel"); 
	Исключение
		Сообщить(ОписаниеОшибки() + " Компанента ExcelNative не найдена на данном компьютере!");
		
	КонецПопытки;
	
	Листов=XLS.ОткрытьФайл(ФайлExcell);	
	
	//ВК	
	ВсегоСтрок= XLS.КоличествоСтрок(1);
	ВсегоКолонок = XLS.КоличествоКолонок(1);
	
    ОсновнойКонтрагентИННКПП = СокрЛП(СтрЗаменить(XLS.ЗначениеЯчейки(1,4,1),"ИНН",""));
    мОсновнойКонтрагентИННКПП = СтрРазделить(ОсновнойКонтрагентИННКПП,"\");
    Если мОсновнойКонтрагентИННКПП.Количество() < 2 Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = нСтр("ru='В загружаемом файле в строке №4 не верно указан ИНН\КПП!!!'", "ru");
        Сообщение.Сообщить();
    КонецЕсли; 
    ИНН = мОсновнойКонтрагентИННКПП[0];	
    КПП = мОсновнойКонтрагентИННКПП[1];	
	
	Контрагент = ПолучитьКонтрагента(ИНН,КПП);
	
	ДеревоЗаказа.Очистить();
	
	Для  Стр = 5 По ВсегоСтрок Цикл
		
		Товар = XLS.ЗначениеЯчейки(1,Стр,1);
		
		Если СокрЛП(Товар) = "" Тогда
			Продолжить;
		КонецЕсли; 
		
		Для Кол = 4 По ВсегоКолонок Цикл
			
			КПП				= Формат(XLS.ЗначениеЯчейки(1,4,Кол), "ЧГ=0");
			КонтаргентНаименование = XLS.ЗначениеЯчейки(1,1,Кол);

			Количество	= XLS.ЗначениеЯчейки(1,Стр,Кол);
			
			Номенклатура = Номенклатура(Товар);

			НовСтр = ДеревоЗаказа.Добавить();
			НовСтр.КонтрагентКПП		  = КПП;
			НовСтр.КонтрагентНаименование = КонтаргентНаименование;
			НовСтр.Контрагент			  = ПолучитьКонтрагента(ИНН,КПП);
			НовСтр.ДоговорыКонтрагентов	  = ПолучитьДоговорКонтрагента(НовСтр.Контрагент,Организация);
			НовСтр.НоменклатураНаименование = Товар;
			НовСтр.Номенклатура			  = Номенклатура;
			НовСтр.Количество 			  = Количество;
		КонецЦикла; 
		
	КонецЦикла; 
	  ДеревоЗаказа.Сортировать("КонтрагентНаименование");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	ПроверкаПройдена = ПроверкаЗаполнения();
	
	Если ПроверкаПройдена Тогда
		СоздатьДокументыНаСервере();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
функция ПроверкаЗаполнения()
	Сообщение = Новый СообщениеПользователю;
	ПроверкаПройдена = Истина;
	
	Если Организация.Пустая() Тогда
		Сообщение.Текст = "НЕ Заполнена Организация";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли Контрагент.Пустая() Тогда 
		Сообщение.Текст = "НЕ Заполнен Контрагент";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли Склад.Пустая() Тогда 
		Сообщение.Текст = "НЕ Заполнен Склад";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли Дата = Дата("00010101") Тогда 
		Сообщение.Текст = "НЕ Заполнена Дата";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли Цена = 0 Тогда
		Сообщение.Текст = "НЕ Заполнена Цена";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли НДС.Пустая() Тогда
		Сообщение.Текст = "НЕ Заполнен НДС";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли ОтпускПроизвел.Пустая() Тогда
		Сообщение.Текст = "НЕ Заполнен Отпуск произвел";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	ИначеЕсли ОтветственныйЗаОформление.Пустая() Тогда
		Сообщение.Текст = "НЕ Заполнен Отвествтвенный за Оформление";
		Сообщение.Сообщить();
		ПроверкаПройдена = Ложь;
	КонецЕсли; 
	
	Для каждого Строка Из ДеревоЗаказа Цикл
		
		Если Строка.Контрагент.Пустая() Тогда
			Сообщение.Текст = "НЕ Заполнен Контрагент";
			Сообщение.Сообщить();
			ПроверкаПройдена = Ложь;
		ИначеЕсли Строка.ДоговорыКонтрагентов.Пустая() Тогда
			Сообщение.Текст = "НЕ Заполнен Договор контрагента";
			Сообщение.Сообщить();
			ПроверкаПройдена = Ложь;
		КонецЕсли; 
		
	КонецЦикла; 
	
	Возврат ПроверкаПройдена;
КонецФункции // *ПроверкаЗаполнения();

&НаСервере
Процедура СоздатьДокументыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТчДерево.Контрагент КАК Контрагент,
	|	ТчДерево.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов,
	|	ТчДерево.КонтрагентНаименование КАК КонтрагентНаименование,
	|	ТчДерево.Номенклатура,
	|	ТчДерево.Количество
	|ПОМЕСТИТЬ ВтДанные
	|ИЗ
	|	&ТчДерево КАК ТчДерево
	|ГДЕ
	|	ТчДерево.Контрагент <> &Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанные.Контрагент КАК Контрагент,
	|	ВтДанные.Номенклатура,
	|	ВтДанные.Количество,
	|	ВтДанные.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ИЗ
	|	ВтДанные КАК ВтДанные
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВтДанные.КонтрагентНаименование
	|ИТОГИ ПО
	|	Контрагент,
	|	ДоговорыКонтрагентов";
	Запрос.УстановитьПараметр("ТчДерево",ДеревоЗаказа.Выгрузить());
	Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоКонтрагенту = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоКонтрагенту.Следующий() Цикл
		Документ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Документ.Дата = Дата;
		Документ.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.Товары;
		Документ.ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		Документ.КратностьВзаиморасчетов = 1;
		Документ.КурсВзаиморасчетов = 1;
		Документ.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.Автоматически;
		Документ.Склад      = Склад;
		Документ.ОтпускПроизвел	= ОтпускПроизвел;
		Документ.ОтветственныйЗаОформление	= ОтветственныйЗаОформление;
		Документ.СуммаВключаетНДС = Истина;
		
		Документ.Организация = Организация;
		Документ.Контрагент = ВыборкаПоКонтрагенту.Контрагент;
		
		ВыборкаДоговоры = ВыборкаПоКонтрагенту.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДоговоры.Следующий() Цикл
			
			Документ.ДоговорКонтрагента =  ВыборкаДоговоры.ДоговорыКонтрагентов;
			
			ВыборкаНоменклатуры = ВыборкаДоговоры.Выбрать();
			
			Пока ВыборкаНоменклатуры.Следующий() Цикл
				НовСтр = Документ.Товары.Добавить();
				НовСтр.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
				НовСтр.Количество   = ВыборкаНоменклатуры.Количество;
				НовСтр.Цена			= Цена;
				НовСтр.СтавкаНДС    = НДС;
				НовСтр.Сумма 	 	= НовСтр.Количество *  НовСтр.Цена;
				
				ОбработкаТабличныхЧастейКлиентСервер.РассчитатьСуммуНДСТабЧасти(НовСтр, Документ.СуммаВключаетНДС, Ложь);
			КонецЦикла; 
			
		КонецЦикла; 
		
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаРасчетов(Документ);
		Документы.РеализацияТоваровУслуг.ЗаполнитьСчетаУчетаВТабличнойЧасти(Документ, "Товары");
		
		Документ.Записать();
	КонецЦикла; 
	
КонецПроцедуры // *

&НаСервере
Функция СохранитьВК()
	ОбъектВК = РеквизитФормыВЗначение("Объект");
	ВкФайл = ОбъектВК.ПолучитьМакет("ExcelNative");
	ВКФайл.Записать(КаталогВременныхФайлов()+"ExcelNative.dll");	
	Возврат КаталогВременныхФайлов()+"ExcelNative.dll";
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоговорКонтрагента(Контрагент,Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеДоговорыКонтрагента.Договор
		|ИЗ
		|	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
		|ГДЕ
		|	ОсновныеДоговорыКонтрагента.Организация = &Организация
		|	И ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
		|	И ОсновныеДоговорыКонтрагента.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Договор;
	КонецЕсли; 

    
КонецФункции // *ПолучитьДоговорКонтрагента(ВыборкаПоКонтрагенту.Контрагент)

&НаСервереБезКонтекста
Функция Номенклатура(Товар)
	СпрНом = Справочники.Номенклатура.НайтиПоНаименованию(Товар);
	
	Если СпрНом.Пустая() Тогда
		СпрНом = Справочники.Номенклатура.СоздатьЭлемент();
		СпрНом.Наименование = Товар;
		СпрНом.Записать();
	КонецЕсли; 
	
	Возврат СпрНом;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонтрагента(ИНН,КПП)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ИНН = &ИНН
		|	И Контрагенты.КПП = &КПП";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЕсли; 

КонецФункции // *ПолучитьКонтрагента(ИНН,КПП)

&НаКлиенте
Процедура ДеревоПриИзменении(Элемент)
	Элементы.ДеревоКоличество.ТекстПодвала = ДеревоЗаказа.Итог("Количество");
КонецПроцедуры
