
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектРек = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ОбъектРек.ПолучитьМакет("Макет");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьВАРМ(Команда)
    
    СтроковыйНомер = 2;
	НомераКолонок  = Новый Структура;
	НомераКолонок.Вставить("Код", "C1");
	НомераКолонок.Вставить("ИнвНомер", "C2");
	НомераКолонок.Вставить("НаименованиеОС", "C3");
	
	СтрокаЗаполнена = ЕстьСтрокиДляОбработки(СтроковыйНомер, НомераКолонок);
		
	НомерСтроки = 0;
	Пока СтрокаЗаполнена Цикл
		НомерСтроки = НомерСтроки + 1;
		НовСтр = ТаблицаОС.Добавить();
		НовСтр.Код 			    = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Код).Текст;
		НовСтр.ИнвНомер 		= ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.ИнвНомер).Текст;
		НовСтр.НаименованиеОС 	= ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.НаименованиеОС).Текст;
        
        СтроковыйНомер = СтроковыйНомер + 1;
		
		СтрокаЗаполнена = ЕстьСтрокиДляОбработки(СтроковыйНомер, НомераКолонок);
	КонецЦикла;
	
	НайтиОСВИБ(ТаблицаОС);

    СтруктураВыбора = Новый Структура();
    СтруктураВыбора.Вставить("ТаблицаОС", ТаблицаОС);
    ОповеститьОВыборе(СтруктураВыбора);

КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НайтиОСВИБ(Знач ТаблицаОС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
    |   ТЧ.Код КАК Код,
    |   ТЧ.ИнвНомер КАК ИнвНомер,
    |   ТЧ.НаименованиеОС КАК НаименованиеОС
    |ПОМЕСТИТЬ ВТ_тч
    |ИЗ
    |   &ТЧ КАК ТЧ
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |   ВТ_тч.ИнвНомер КАК ИнвНомер,
    |   ВТ_тч.НаименованиеОС КАК НаименованиеОС,
    |   ОбъектыЭксплуатации.Ссылка КАК ОсновноеСредство,
    |   ОбъектыЭксплуатации.Код КАК Код
    |ИЗ
    |   ВТ_тч КАК ВТ_тч
    |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
    |       ПО ВТ_тч.ИнвНомер = ОбъектыЭксплуатации.ИнвентарныйНомер";
    
    Запрос.УстановитьПараметр("ТЧ", ТаблицаОС.Выгрузить());
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбъектЗначение = РеквизитФормыВЗначение("ТаблицаОС");
	ОбъектЗначение.Очистить();
	Для каждого Стр Из Результат Цикл
		НовСтр = ОбъектЗначение.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, Стр);
	КонецЦикла; 

	ЗначениеВРеквизитФормы(ОбъектЗначение, "ТаблицаОС");

	
КонецПроцедуры 

Функция ЕстьСтрокиДляОбработки(СтроковыйНомер, НомераКолонок)
	
	Код            = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.Код).Текст;
	ИнвНомер       = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.ИнвНомер).Текст;
	НаименованиеОС = ТабличныйДокумент.Область("R" + СтроковыйНомер + НомераКолонок.НаименованиеОС).Текст;
	
	СтрокаЗаполнена = ЗначениеЗаполнено(Код) Или ЗначениеЗаполнено(ИнвНомер)
												Или ЗначениеЗаполнено(НаименованиеОС);
												
	Возврат СтрокаЗаполнена;											
КонецФункции

#КонецОбласти

