
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
    Информация   = нСтр("ru='Задаются поле номенклатуры значение которого ищется 
                                                | в значении заданого поля номенклатуры поставщика.Ограничение на поле поставщика: 
                                                |оно не должно быть менее 4 символов.'", "ru");
    Представление = нСтр("ru='Квартон: Привязка номенклатуры к номенклатуре партнера по заданным поля.'", "ru");
    Идентификатор = "Квартон_ПривязкаНоменклатурыКНоменклатуреПартнераПоЗаданнымПоля";
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Информация = Информация;
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0.0.4";
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Представление;
	Команда.Идентификатор = Идентификатор;
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

#КонецОбласти
