
&НаКлиенте
Процедура ПолучитьСтраницу(Команда)
	СтраницаСайта = АдресСтраницыСайта;
	
	ПодключитьОбработчикОжидания("СообщитьОЗагрузкеСтраницы",1);
	
	
	ПолучитьСтраницуНаСервере();
	
КонецПроцедуры


// ++ *ММГ 25.02.2020 Номер задачи: ;   
// Описание: .
// Параметры: 
&НаКлиенте
Процедура СообщитьОЗагрузкеСтраницы()
	
	readyState = Элементы.СтраницаСайта.Документ.readyState;
	
	Если ВРег(readyState) = ВРег("complete") 
		И ДокументHTMLСформирован Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "СтраницаЗагружена!!";
		Сообщение.Сообщить();
		ОтключитьОбработчикОжидания("СообщитьОЗагрузкеСтраницы");
	КонецЕсли; 
	
КонецПроцедуры // -- *ММГ 25.02.2020



&НаСервере
Процедура ПолучитьСтраницуНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницаСайтаДокументСформирован(Элемент)
	ДокументHTMLСформирован = Истина;
КонецПроцедуры
