
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницаСайтаДокументСформирован(Элемент)
	ДокументHTMLСформирован = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьСтраницу(Команда)
	СтраницаСайта = АдресСтраницыСайта;
	
	ПодключитьОбработчикОжидания("СообщитьОЗагрузкеСтраницы",1);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СообщитьОЗагрузкеСтраницы()
	
	readyState = Элементы.СтраницаСайта.Документ.readyState;
	
	Если ВРег(readyState) = ВРег("complete") 
		И ДокументHTMLСформирован Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "СтраницаЗагружена!!";
		Сообщение.Сообщить();
		ОтключитьОбработчикОжидания("СообщитьОЗагрузкеСтраницы");
	КонецЕсли; 
	
КонецПроцедуры // -- *ММГ 25.02.2020

#КонецОбласти

