
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ПДО_глЗначениеПеременной("НКТУ");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы



&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	ЭтотОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЭтотОбъект.ЗагрузитьДанныеИзУХ();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧДокументыПриАктивизацииСтроки(Элемент)
	Если Элементы.ТЧДокументы.ТекущиеДанные <> Неопределено Тогда
		Элементы.РасшифровкаПлатежа.ОтборСтрок.КлючСвязи.Установить(Элементы.ТЧДокументы.ТекущиеДанные.КлючСвязи);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеКонтрагенты

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеБанковскиеСчета

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеДоговорыКонтрагентов

#КонецОбласти

#Область ОбработчикиКомандФормы


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти