
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура apifoxtools(Команда)
	ИдентификаторКоманды = "ПолучениеБесплатногоПрокси_api_foxtools_ru";
	ИмяСобытия = "Квартон.ПолучениеБесплатногоПрокси_api_foxtools_ru";
	ПолучитьПрокси(ИдентификаторКоманды, ИмяСобытия);
КонецПроцедуры

&НаКлиенте
Процедура kupitproxy(Команда)
	ИдентификаторКоманды = "Квартон_ПолучениеПлатногоПрокси_kupit_proxy_ru";
	ИмяСобытия = "Квартон.ПолучениеПрокси_kupit_proxy_ru";
	ПолучитьПрокси(ИдентификаторКоманды, ИмяСобытия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьПрокси(ИдентификаторКоманды, ИмяСобытия)
    ОбоработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбоработкаОбъект.ПолучитьПроксиСервера(ИдентификаторКоманды, ИмяСобытия);
КонецПроцедуры

#КонецОбласти

