
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	Информация = НСтр("ru='Получение HTTPS бесплатного прокси api.foxtools.ru в формате *.txt'")
  				+ Символы.ПС + НСтр("ru='Получение HTTPS прокси kupit-proxy.ru в формате *.txt'")
				+ Символы.ПС + НСтр("ru='Для работы нужен интегрированный в конфигурацию Общий модуль ""КоннекторHTTP""'")
				+ Символы.ПС + НСтр("ru='""КоннекторHTTP"" - https://infostart.ru/public/709325/ '")
  				+ Символы.ПС + НСтр("ru='История'")
				+ Символы.ПС + НСтр("ru='06.11.2019 - Обновлен ключ для сайта kupit-proxy.ru'");
	
	ПараметрыРегистрации.Информация = Информация;
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.1.0.1";
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	
	Представление = НСтр("ru = 'Квартон: Бесплатные HTTPS прокси api.foxtools.ru'");
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Представление;
	Команда.Идентификатор = "Квартон_ПолучениеБесплатногоПрокси_api_foxtools_ru";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Ложь;
	
	Представление = НСтр("ru = 'Квартон: Платные прокси с kupit-proxy.ru'");
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = Представление;
	Команда.Идентификатор = "Квартон_ПолучениеПлатногоПрокси_kupit_proxy_ru";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	Команда.ПоказыватьОповещение = Ложь;
	
	Возврат ПараметрыРегистрации;

КонецФункции

Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт
	
	Если ИдентификаторКоманды = "ПолучениеБесплатногоПрокси_api_foxtools_ru" Тогда
		ИмяСобытия = "Квартон.ПолучениеБесплатногоПрокси_api_foxtools_ru";
	КонецЕсли;
	
	Если ИдентификаторКоманды = "Квартон_ПолучениеПлатногоПрокси_kupit_proxy_ru" Тогда
		ИмяСобытия = "Квартон.ПолучениеПрокси_kupit_proxy_ru";
	КонецЕсли;
	
	Предупреждение = УровеньЖурналаРегистрации.Предупреждение;
	ЗафиксироватьНачалоОкончанияПолученияПрокси(ИмяСобытия, Предупреждение, "Начало");
	
	ПолучитьПроксиСервера(ИдентификаторКоманды, ИмяСобытия);
	
	ЗафиксироватьНачалоОкончанияПолученияПрокси(ИмяСобытия, Предупреждение, "Окончание");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПолучитьПроксиСервера(ИдентификаторКоманды, ИмяСобытия) Экспорт
	
	ОписаниеОшибки = "";
	КоличествоПопыток = 0;
	КодСостояния200 = 200;
	ВремменыйФайл = ПолучитьИмяВременногоФайла("txt");
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Записать(ВремменыйФайл);
	
	Если ИдентификаторКоманды = "ПолучениеБесплатногоПрокси_api_foxtools_ru"  Тогда
		СтруктураЗапроса = ПолучитьДанныеСервераApiFoxtools();
	КонецЕсли; 
	
	Если ИдентификаторКоманды = "Квартон_ПолучениеПлатногоПрокси_kupit_proxy_ru"  Тогда
		СтруктураЗапроса = ПолучитьДанныеСервераKupitProxy();
	КонецЕсли; 
	
	url 	  = СтруктураЗапроса.url;
	Заголовки = СтруктураЗапроса.Заголовки;
	
	Попытка
		Результат = КоннекторHTTP.Get(url, Неопределено, Новый Структура("Заголовки", Заголовки));
		ДД = КоннекторHTTP.КакДвоичныеДанные(Результат);
		ДД.Записать(ВремменыйФайл);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Если Результат <> Неопределено И Результат.КодСостояния = КодСостояния200 Тогда
		ЗаполнитьСправочник(ВремменыйФайл);
	Иначе 
		ОписаниеОшибки = НСтр("ru='Данные с сайта не получены !!!'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(ОписаниеОшибки)  Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки);
	КонецЕсли; 
	
	УдалитьФайлы(ВремменыйФайл);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗафиксироватьНачалоОкончанияПолученияПрокси(ИмяСобытия, Предупреждение, Комментарий)
	ЗаписьЖурналаРегистрации(ИмяСобытия, Предупреждение, , , Комментарий + ": "+Формат(ТекущаяДатаСеанса(), "ДЛФ=DDT"));
КонецПроцедуры

Функция ПолучитьДанныеСервераApiFoxtools()
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("type", "2");
	Заголовки.Вставить("anonymity", "15");
	Заголовки.Вставить("available", "1");
	Заголовки.Вставить("free", "1");
	Заголовки.Вставить("uptime", "20");
	
	url = "api.foxtools.ru/v2/Proxy.txt";
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", url);
	СтруктураЗапроса.Вставить("Заголовки", Заголовки);
		
	Возврат СтруктураЗапроса;
	
КонецФункции

Функция ПолучитьДанныеСервераKupitProxy()
	
    // Proxykey получается в личном кабинете после оплаты
	ОсновнойURL = "http://kupit-proxy.ru/api/GetProxiesTxt?key=";
	Proxykey = "1025fdd8-585d-4934-a90a-16e3d86e1142";
	protocols = "protocols=https";
	anonymityLevels = "anonymityLevels=elite";
	uprate = "uprate=60";
	services = "services=Yandex";
	url = ОсновнойURL + Proxykey + "&" + protocols + "&" + anonymityLevels + "&" + uprate;
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", url);
	СтруктураЗапроса.Вставить("Заголовки", Новый Соответствие);
		
	Возврат СтруктураЗапроса;
	
КонецФункции

// Описание: // *ММГ 20.12.2018   
// Параметры:
Процедура ЗаполнитьСправочник(ВремменыйФайл)
	ДлинаIPАдреса = 4; // Количество элементов в массиве без точек.
	Строка15 = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));
	Число10	 = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(10, 0, ДопустимыйЗнак.Любой));	
	
	ТаблицаПрокси = Новый ТаблицаЗначений;
	ТаблицаПрокси.Колонки.Добавить("Сервер", Строка15);
	ТаблицаПрокси.Колонки.Добавить("Порт", Число10);
	
	
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ВремменыйФайл);
	Стр = ЧтениеТекста.ПрочитатьСтроку();
	Пока Стр <> Неопределено Цикл 
		
		Если СтрНайти(Стр, ":") = 0 Тогда
			Стр = ЧтениеТекста.ПрочитатьСтроку();
			Продолжить;
		КонецЕсли; 

		ЗаченияПрокси = СтрРазделить(Стр, ":");
		
		Если ЗаченияПрокси.Количество() > 0 Тогда
			ЭтоIP4 = СтрРазделить(ЗаченияПрокси[0], ".").Количество() = ДлинаIPАдреса;
			Если НЕ ЭтоIP4 Тогда
				Продолжить;
			КонецЕсли; 
			НайденСправочник = Справочники.ПроксиСервера.НайтиПоНаименованию(ЗаченияПрокси[0], Истина);
			
			Если НайденСправочник.Пустая() Тогда
				НовСтр = ТаблицаПрокси.Добавить();
				НовСтр.Сервер	= ЗаченияПрокси[0];
				НовСтр.Порт 	= ЗаченияПрокси[1];
			КонецЕсли; 
			
		КонецЕсли; 
		
		Стр = ЧтениеТекста.ПрочитатьСтроку();
	КонецЦикла;

    Если ТаблицаПрокси.Количество() > 0 Тогда
		ОбновитьПрокси(ТаблицаПрокси);
	КонецЕсли; 
КонецПроцедуры // *ЗаполнитьСправочник(ВремменыйФайл)

// Описание: // *ММГ 08.04.2019   
// Параметры:
Процедура ОбновитьПрокси(ТаблицаПрокси)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.сервер КАК сервер,
		|	ТЧ.порт КАК порт
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	кв_ПлохойПрокси.Прокси КАК Прокси
		|ИЗ
		|	РегистрСведений.кв_ПлохойПрокси КАК кв_ПлохойПрокси
		|
		|СГРУППИРОВАТЬ ПО
		|	кв_ПлохойПрокси.Прокси
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.сервер КАК сервер,
		|	ВременнаяТаблица.порт КАК порт,
		|	ПроксиСервера.Ссылка КАК Ссылка
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПроксиСервера КАК ПроксиСервера
		|		ПО ВременнаяТаблица.сервер = ПроксиСервера.Наименование
		|			И ВременнаяТаблица.порт = ПроксиСервера.Порт
		|ГДЕ
		|	ЕСТЬNULL(ПроксиСервера.Ссылка, ЗНАЧЕНИЕ(Справочник.ПроксиСервера.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ПроксиСервера.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("ТЧ", ТаблицаПрокси);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Результат1 = МассивРезультатов[1];
	ВыборкаДетальныеЗаписи = Результат1.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СпрОбъект = ВыборкаДетальныеЗаписи.Прокси.ПолучитьОбъект();
		СпрОбъект.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	Результат2 = МассивРезультатов[2];
	ВыборкаДетальныеЗаписи = Результат2.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СпрОбъект = Справочники.ПроксиСервера.СоздатьЭлемент();
		СпрОбъект.Наименование = ВыборкаДетальныеЗаписи.Сервер;
		СпрОбъект.Порт = ВыборкаДетальныеЗаписи.Порт;
		СпрОбъект.Записать();
	КонецЦикла;	           	
		
КонецПроцедуры // *ОбновитьПрокси
 
#КонецОбласти
