
#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	Информация = НСтр("ru = 'В таблицу выводится номенклатура поставщика не более 5000 позиций,
						|потом нужно указать вид номенклатуры и номенклатурную группу .'");
	ПараметрыРегистрации.Информация = Информация;
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Версия = "1.0.0.10";
	ПараметрыРегистрации.БезопасныйРежим = Истина;
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
	Команда.Представление = НСтр("ru = 'Квартон: Создание номенклатуры на основе номенклатуры поставщика'");
	Команда.Идентификатор = "Квартон_СозданиеНоменклатурыНаОсновеНоменклатурыПоставщика";
	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
	Команда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;

КонецФункции

#КонецОбласти
