
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ДополнительнаяОбработкаСсылка) Тогда
		
		ХранилищеНастроек = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							Параметры.ДополнительнаяОбработкаСсылка,
							"ХранилищеНастроек");
							
		Настройки = ХранилищеНастроек.Получить();
		
		Если ТипЗнч(Настройки) = Тип("Структура") Тогда
			Период = Настройки.Период;
			ВидЦены = Настройки.ВидЦены;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Пачка = 100;
	Пауза = 30;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ПерезаполнениеВидовЗапасов

&НаКлиенте
Процедура Проверка(Команда)
	УстановитьНаСервере(Истина);
	Элементы.Декорация2.Заголовок = "ГОТОВО.";
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Если Пачка = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена 'Пачка'. ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	УстановитьНаСервере(Ложь);
	Элементы.Декорация2.Заголовок = "ГОТОВО";
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПоВыбранной(Команда)
	Если Пачка = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнена 'Пачка'. ";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли; 
	УстановитьПоВыбраннойНаСервере();
	Элементы.Декорация2.Заголовок = "ГОТОВО";
КонецПроцедуры

#КонецОбласти //ПерезаполнениеВидовЗапасов

#Область ОчисткаРезервовОрганизации

&НаКлиенте
Процедура ОчиститьНеПроведенные(Команда)
	ОчиститьНеПроведенныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВесьРегистр(Команда)
	ОчиститьВесьРегистрНаСервере();
КонецПроцедуры

#КонецОбласти //ОчисткаРезервовОрганизации

&НаКлиенте
Процедура ПолнаяПередачаТоваров(Команда)
	ПолнаяПередачаТоваровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОграниченаяПередачаТоваров(Команда)
	ОграниченаяПередачаТоваровНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПараметры(Команда)
	СохранитьПараметрыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьНаСервере(ПроверкаКоличестваДокументов)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПроверкаКоличестваДокументов", ПроверкаКоличестваДокументов);
	СтруктураПараметров.Вставить("Период", Период);
	СтруктураПараметров.Вставить("Пачка", Пачка);
	СтруктураПараметров.Вставить("Пауза", Пауза);
	МассивОшибок = Новый Массив;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПерезаполнениеВидовЗапасов(СтруктураПараметров, МассивОшибок);
	
	КоличествоДокуменов = МассивОшибок[0];
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПоВыбраннойНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	МассивОшибок = Новый Массив;
	ОбработкаОбъект.ПерезаполнениеВидовЗапасовПоВыбраннойАналитики(Период, СписокАналитикНоменклатуры, МассивОшибок);
КонецПроцедуры

#Область ОчисткаРезервовОрганизации

&НаСервере
Процедура ОчиститьНеПроведенныеНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьВесьРегистрРезервовОрганизации(Дата("00010101"), Истина);
КонецПроцедуры

&НаСервере
Процедура ОчиститьВесьРегистрНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОчиститьВесьРегистрРезервовОрганизации(ДатаОт, Ложь);
КонецПроцедуры

#КонецОбласти //ОчисткаРезервовОрганизации

&НаСервере
Процедура ПолнаяПередачаТоваровНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьНастройкуПередачиТоваров(Перечисления.СпособыПередачиТоваров.Продажа, ВидЦены);
КонецПроцедуры

&НаСервере
Процедура ОграниченаяПередачаТоваровНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ОбновитьНастройкуПередачиТоваров(Перечисления.СпособыПередачиТоваров.НеПередается, ВидЦены);
КонецПроцедуры

&НаСервере
Процедура СохранитьПараметрыНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СохранитьПараметрыАвтоПерезаполненияВидовЗапасов(Период, ВидЦены, Параметры);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РезервыТоваровОрганизаций.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	РегистрНакопления.РезервыТоваровОрганизаций КАК РезервыТоваровОрганизаций
	|ГДЕ
	|	РезервыТоваровОрганизаций.Период МЕЖДУ &ДатаНач И &ДатаОкон
	|
	|СГРУППИРОВАТЬ ПО
	|	РезервыТоваровОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(КвартонСебестоимостьОбороты.СуммаПриход, 0) КАК Сумма,
	|	ЕСТЬNULL(КвартонСебестоимостьОбороты.КоличествоПриход, 0) КАК Количество
	|ПОМЕСТИТЬ ВТ_Итог
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.КвартонСебестоимость.Обороты(&ДатаНач, &ДатаОкон, , ) КАК КвартонСебестоимостьОбороты
	|		ПО ВТ_Номенклатура.Номенклатура = КвартонСебестоимостьОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Итог.Номенклатура КАК Номенклатура,
	|	ВТ_Итог.Сумма КАК Сумма,
	|	ВТ_Итог.Количество КАК Количество
	|ИЗ
	|	ВТ_Итог КАК ВТ_Итог
	|ГДЕ
	|	ВТ_Итог.Сумма <> 0
	|	И ВТ_Итог.Количество <> 0";
	
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкон", КонецДня(Период.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	ДокОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	ДокОбъект.Дата = Период.ДатаОкончания;
	
	НовСтрВидЦены = ДокОбъект.ВидыЦен.Добавить();
	НовСтрВидЦены.ВидЦены = ВидЦены;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Наценка = 1.01;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли; 
		 НовСтр = ДокОбъект.Товары.Добавить();
		 НовСтр.ВидЦены = ВидЦены;
		 НовСтр.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		 НовСтр.Цена		 = (ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Количество) * Наценка;
	КонецЦикла;
	
	ДокОбъект.Заполнить(Неопределено);
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);	
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);	
	КонецПопытки; 
	
	ДокументУстановкиЦен = ДокОбъект.Ссылка;	
КонецПроцедуры

#КонецОбласти