#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Организация = Параметры.Организация;
    Период = Параметры.Дата;
    
    МножественныйВыбор = Параметры.МножественныйВыбор;
    Элементы.Таблица.МножественныйВыбор = МножественныйВыбор;
    Элементы.Таблица.РежимВыделения = ?(МножественныйВыбор, 
                                        РежимВыделенияТаблицы.Множественный, 
                                        РежимВыделенияТаблицы.Одиночный);    
    ИнициализироватьКомпоновкуДанных();
    
    ЗаполнитьПоОтборуНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОСНастройкиОтборПриИзменении(Элемент)
    ЗаполнитьПоОтборуНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Команда)
    ЗаполнитьПоОтборуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
    ВыбранныеЭлементы = Новый Массив;
    
    Если МножественныйВыбор Тогда
        Для каждого ИдентификаторСтроки Из Элементы.Таблица.ВыделенныеСтроки Цикл
            ДанныеСтроки = Элементы.Таблица.ДанныеСтроки(ИдентификаторСтроки);
            ВыбранныеЭлементы.Добавить(ДанныеСтроки);
        КонецЦикла;
    Иначе
        ВыбранныеЭлементы.Добавить(Элементы.Таблица.ТекущиеДанные);
    КонецЕсли;
    
    ОповеститьОВыборе(ВыбранныеЭлементы);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных()
    СхемаКомпоновкиДанных = Обработки.тн_МассовоеПеремещениеОС.ПолучитьМакет("МакетСКД");
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	ОтборОС.Инициализировать(ИсточникНастроек);
	
	ОтборОС.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоОтборуНаСервере()
	
    Обработки.тн_МассовоеПеремещениеОС.УстановитьНастройкиСКД(Период, Организация, ОтборОС);
    
    СхемаКомпоновкиДанных = Обработки.тн_МассовоеПеремещениеОС.ПолучитьМакет("МакетСКД");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ОтборОС.ПолучитьНастройки(), , ,
                                                    Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Таблица.Загрузить(ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных));
    
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтбор(ИмяПолеОтбора, Значение)
    
    Настройки = ОтборОС.Настройки;
        
    ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПолеОтбора);
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементОтбора.ПравоеЗначение = Значение;
    
    Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор",
                                                            ТипВыводаТекстаКомпоновкиДанных.Выводить);
    ЗаполнитьПоОтборуНаСервере();
    
КонецПроцедуры

#КонецОбласти
