
#Область ОбработчикиСобытийФормы

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	Организация = ПДО_глЗначениеПеременной("НКТУ");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументы

Процедура ДокументыПриАктивизацииСтроки(Элемент)
	
	Если ЭлементыФормы.ТЧДокументы.ТекущиеДанные <> Неопределено Тогда
		ЭлементыФормы.РасшифровкаПлатежа.ОтборСтрок.КлючСвязи.Установить(ЭлементыФормы.ТЧДокументы.ТекущиеДанные.КлючСвязи);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ТЧДокументыПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого Оформление Из ОформленияСтрок Цикл
		Если ЗначениеЗаполнено(Оформление.ДанныеСтроки.ДокументСсылка) Тогда
			Продолжить;	
		КонецЕсли;
		
		Оформление.ЦветФона	= WebЦвета.СветлоРозовый;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеКонтрагенты

Процедура ПолученныеКонтрагентыПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого Оформление Из ОформленияСтрок Цикл
		Если ЗначениеЗаполнено(Оформление.ДанныеСтроки.Контрагент) Тогда
			Продолжить;	
		КонецЕсли;
		
		Оформление.ЦветФона	= WebЦвета.СветлоРозовый;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеБанковскиеСчета

Процедура ПолученныеБанковскиеСчетаПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого Оформление Из ОформленияСтрок Цикл
		Если ЗначениеЗаполнено(Оформление.ДанныеСтроки.БанковскийСчет) Тогда
			Продолжить;	
		КонецЕсли;
		
		Оформление.ЦветФона	= WebЦвета.СветлоРозовый;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПолученныеДоговорыКонтрагентов

Процедура ПолученныеДоговорыПриПолученииДанных(Элемент, ОформленияСтрок)
	
	Для Каждого Оформление Из ОформленияСтрок Цикл
		Если ЗначениеЗаполнено(Оформление.ДанныеСтроки.ДоговорКонтрагента) Тогда
			Продолжить;	
		КонецЕсли;
		
		Оформление.ЦветФона	= WebЦвета.СветлоРозовый;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура ДействияФормыЗагрузитьДанные(Кнопка)
	
	Если Не ЭтотОбъект.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;
	
	ЗагрузитьДанныеИзУХ();
	
КонецПроцедуры

Процедура ДействияФормыПроверитьКонтрагентов(Кнопка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Владелец.Код КАК КодКонтрагента,
	|	ДоговорыКонтрагентов.Владелец.ИНН КАК ИННКонтрагента,
	|	ДоговорыКонтрагентов.Владелец.КПП КАК КППКонтрагента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Владелец.КодSAP = """"
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.СрокДействия >= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить(НСтр("ru='Контрагенты с пустым кодом SAP не найдены'"));	
	Иначе
		Сообщить(НСтр("ru='Найдены контрагенты с пустым кодом SAP'"));
		
		ТабДок = Новый ТабличныйДокумент;
		
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(РезультатЗапроса.Выгрузить());
		Построитель.Выполнить();
		Построитель.Вывести(ТабДок);
		
		ТабДок.Показать("Контрагенты с пустым кодом SAP");
	КонецЕсли;
	
КонецПроцедуры

// rarus kzn maksma 000000242896 10.03.2020 {
Процедура ДействияФормыСвязатьКонтрагентов(Кнопка)	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тч.Контрагент,
		|	тч.КодSAP
		|ПОМЕСТИТЬ ВремТЧ
		|ИЗ
		|	&тч КАК тч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.КодSAP,
		|	ВремТЧ.КодSAP КАК КодSAPИзУХ
		|ИЗ
		|	ВремТЧ КАК ВремТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО ВремТЧ.Контрагент = Контрагенты.Ссылка
		|			И ВремТЧ.КодSAP <> Контрагенты.КодSAP";
	Запрос.УстановитьПараметр("тч",ПолученныеКонтрагенты);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.КодSAP) Тогда
			СпрКонтрагенты = Выборка.Ссылка.ПолучитьОбъект();
			СпрКонтрагенты.КодSAP = Выборка.КодSAPИзУХ;
			СпрКонтрагенты.ОбменДанными.Загрузка = Истина;
			СпрКонтрагенты.Записать();
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
// rarus kzn maksma 000000242896 10.03.2020 }

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти